Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཟད་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of exhaustion.

source: གང་ཉོན་མོངས་པ་ཟད་པ་དེ་ཟག་པ་ཟད་པའོ། །
en: When disturbing emotions are exhausted, defilements are exhausted.

source: གང་ཟག་པ་ཟད་པ་དེ་ཉོན་མོངས་པ་ཟད་ཅིང་དེ་སྡུག་བསྔལ་ཟད་པའོ། །
en: When defilements are exhausted, disturbing emotions are exhausted. In that way suffering is exhausted.

source: གང་སྡུག་བསྔལ་ཟད་པ་དེ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་སྟེ།
en: Whoever exhausts suffering attains nirvāṇa, and

source: འཁོར་བའི་ལམ་དུ་མི་འཇུག་གོ། །
en: does not tread on the path of saṃsāra.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཟད་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way the Thus-Gone One correctly understands exhaustion.

source: དེ་ལ་ཤེས་པ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་ཟད་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: To know, . . . and be skillful about this is called knowing exhaustion .

source: དེ་བཞིན་གཤེགས་པ་ཟད་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of exhaustion,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མི་སྐྱེ་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of no-birth.

source: སྲེད་པའི་རྐྱེན་གྱིས་སྡུག་བསྔལ་འགྲུབ་ལ། ཤེས་པའི་དབང་གིས་དེའི་སྤོང་བ་འགྲུབ་སྟེ།
en: Through the circumstance of craving, suffering is formed; yet, through the power of knowledge, one can accomplish its abandonment.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་མི་སྐྱེ་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way the Thus-Gone One correctly understands no-birth.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ཤེས་པ་གང་གིས་ཉོན་མོངས་པ་སྤོང་བ་ཡོངས་སུ་མཁྱེན་ཏེ། དེ་ནི་མི་སྐྱེ་བ་ཤེས་པའོ། །
en: Householder, moreover, the Thus-Gone One understands the knowledge by which disturbing emotions are abandoned, and that is knowing no-birth.

source: དེ་ལ་ཤེས་པ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་མི་སྐྱེ་བ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, . . . and be skillful about this is called knowing no-birth .

source: དེ་བཞིན་གཤེགས་པ་མི་སྐྱེ་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of no-birth,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of omniscience.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་ལ་གཞན་ལ་རག་མ་ལུས་པའི་ཤེས་པ་ལ་དམིགས་ནས། ངས་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པའི་ཆོས་གང་ཡང་མེད་དེ།
en: Householder, when the Thus-Gone One observes the cognition that independently knows all phenomena, he understands, ‘There are no phenomena that I do not fully understand.

source: གང་ཕ་རོལ་དག་གིས་དེ་ཆོས་འདི་དག་ལ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་སོ་ཞེས་རྒོལ་བ་ལ་བསྙེངས་པ་མི་མངའོ། །
en: No one will be able to contradict me by claiming that there is any phenomena that I do not fully understand.’

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་མ་ལུས་པར་ཐུགས་སུ་ཆུད་པ་ལ་བཞུགས་སོ། །
en: In this way the Thus-Gone One rests in the understanding of everything.

source: དེ་བཞིན་གཤེགས་པ་མ་ལུས་པར་ཐུགས་སུ་ཆུད་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about his understanding of everything,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the correct understanding of the meaning.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the correct understanding of the meaning in the following manner.

source: ཡི་གེ་འདི་ནི་དོན་འདི་སྟོན་ཏེ།
en: ‘This syllable expresses this meaning.

source: འདི་ལྟ་སྟེ་ཆོས་ཀྱི་དོན་དང་། སེམས་ཅན་གྱི་དོན་དང་། སྲོག་མེད་པའི་དོན་དང་། གང་ཟག་མེད་པའི་དོན་དང་། སྟོང་པ་ཉིད་ཡོངས་སུ་བསྟན་པའི་དོན་དང་། མཚན་མ་དང་བྲལ་བའི་དོན་དང་། སྨོན་ལམ་དང་བྲལ་བ་སྟེ། དེ་ཡང་འདིར་བརྗོད་པར་བྱ་ཞིང་འདི་ལྟར་མངོན་དུ་དཔྱད་པར་བྱ་སྟེ།
en: Thus, the meaning of dharma , the meaning of beings , the meaning of no life force , the meaning of no person , the meaning taught by emptiness, the meaning of absence of marks , and the meaning of absence of wishes should all be expressed and analyzed.

source: འདི་ལྟ་སྟེ། མི་རྟག་པ་ཞེའམ། སྡུག་བསྔལ་བ་ཞེའམ། བདག་མེད་པ་ཞེའམ། མཚན་མ་དང་བྲལ་བ་ཞེའམ། སྨོན་པ་དང་བྲལ་བ་ཞེའམ། ཞི་བ་ཞེའམ། རློམ་སེམས་མེད་པ་ཞེའམ། བདག་འདུལ་བ་ཞེའམ། མངོན་པར་འདུ་མི་བྱེད་པ་ཞེའམ། སྤྲོས་པ་མེད་པ་ཞེས་བྱའོ། །ཡི་གེ་འདི་དག་ནི་དུས་དང་ལྡན་པར་སོ་སོར་བརྗོད་པར་བྱ་སྟེ།
en: Thus, at the appropriate times, one should express the words impermanence, suffering, no self, absence of marks, absence of wishes, peace, absence of conceit, taming of oneself, no formation , and no proliferation .

source: བདག་ཏུ་མངོན་པར་ཆགས་པ་དག་གི་དུས་སུ་ནི་སྟོང་པ་ཉིད་དོ། །
en: When someone is attached to the self, one should know the correct understanding of emptiness.

source: མཚན་མ་ལ་མངོན་པར་ཆགས་པ་དག་གི་དུས་སུ་ནི་མཚན་མ་མེད་པའོ། །
en: When someone is attached to marks, one should know the absence of marks.

source: སྨོན་ལམ་ལ་མངོན་པར་ཆགས་པ་དག་གི་དུས་སུ་ནི་སྨོན་པ་མེད་པའོ། །
en: When there is attachment to wishes, one should know the absence of wishes.

source: བསམ་པ་རྣམ་པར་སྤྱོད་པ་དག་ལ་ནི་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པའོ། །
en: When there is involvement in thought, one should have the correct understanding of eloquence.’

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see . . . and be skillful about this is called knowing the correct understanding .

source: དེ་བཞིན་གཤེགས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the correct understanding of the meaning,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the characteristics of the Thus-Gone One.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་བཞི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the four characteristics of the Thus-Gone One.

source: འདི་ལྟ་སྟེ། གླང་པོ་ཆེ་ལྟར་གཟིགས་པ་ཉིད་དང་། སེང་གེ་ལྟར་རྣམ་པར་བསྒྱིངས་པ་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ལ་འཇུག་པ་ཉིད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལམ་དང་རྗེས་སུ་འཐུན་པ་ཉིད་དོ། །
en: They are: gazing like an elephant, stretching like a lion, knowing the thoughts of all beings, and acting in accord with the paths of all beings.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་མཚན་ཉིད་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see, . . . and be skillful about this is called knowing the characteristics of the Thus-Gone One .

source: དེ་བཞིན་གཤེགས་པ་མཚན་ཉིད་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of these characteristics,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the abodes of the Thus-Gone One.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བྱམས་པ་བསྒོམ་པར་མཛད་དེ།
en: Householder, the Thus-Gone One practices love for the sake of all beings.

source: ངས་སེམས་ཅན་འདི་དག་གི་སྐྱེ་བའི་འཇིགས་པ་ལས་བསྐྱབ་པར་བྱ། རྒ་བའི་འཇིགས་པ་དང་། ནད་ཀྱི་འཇིགས་པ་དང་། འཆི་བའི་འཇིགས་པ་ལས་བསྐྱབ་པར་བྱ།
en: He knows, ‘I must protect these beings from their fear of birth, from their fear of old age, from their fear of sickness, and from their fear of death.’

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར། བྱམས་པ་བསྒོམ་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་གནས་པ་དང་པོའོ། །
en: This practice of love for the sake of the welfare and happiness of all beings is the first abode of the Thus-Gone One.

source: ཀྱེ་ཨེ་མ་སེམས་ཅན་འདི་དག་ནི་སྡུག་བསྔལ་བ་སྟེ།
en: ‘Oh, these beings suffer.

source: དེ་དག་གི་སྡུག་བསྔལ་བསལ་བའི་དོན་དུ་ཆོས་བསྟན་པར་བྱའོ། །
en: I must teach the Dharma in order to clear away their suffering.

source: གཞན་མ་ཡིན་པ་འཕགས་པའི་ལམ་གྱིས་ཐར་བར་བྱའོ། །
en: I must liberate them by nothing but the path of the noble ones.’

source: ཞེས་ཐུགས་རྗེ་བསྐྱེད་པར་མཛད་དོ། །
en: He also engenders compassion in this way:

source: གཞན་མ་ཡིན་པའི་ལམ་འདི་ནི་དེ་བཞིན་དུ་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པའོ་ཞེས་དགྱེས་པ་བསྐྱེད་པར་མཛད་དོ། །
en: He is delighted in this way: ‘This very path will liberate them from suffering.’

source: དགྱེས་པ་དེ་སྡུག་བསྔལ་ཐམས་ཅད་ལས་བཏང་སྙོམས་སུ་མཛད་ཅིང་། སེམས་པ་མེད་པའི་བཏང་སྙོམས་བསྐྱེད་པར་མཛད་དེ།
en: His delight transforms all suffering into equanimity and thus he engenders an equanimity that is free from mentation.

source: འདི་དག་ནི་དེ་བཞིན་གཤེགས་པའི་གནས་པ་བཞི་པའོ། །
en: These are the four abodes of the Thus-Gone One.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see, . . . and be skillful about this is called knowing the abodes of the Thus-Gone One .

source: དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པའི་གནས་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the abodes of the Thus-Gone One,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the faculties of the Thus-Gone One.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་བསྐལ་པ་བྱེ་བ་དཔག་ཏུ་མེད་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པར་བསྒྲུབ་པ་ལ་དོན་དུ་གཉེར་བ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands how to strive toward the accomplishment of the factors of awakening over boundless millions of eons.

source: དང་བའི་སེམས་དང་། རྙོག་པ་མེད་པའི་སེམས་དང་། དཀྲུགས་པ་མེད་པའི་སེམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the clear mind, the unsullied mind, and the undisturbed mind.

source: བྱང་ཆུབ་ཀྱི་སེམས་ལ་གཞོལ་བ་དང་། སེམས་རབ་ཏུ་བསྡུས་པ་དང་། སེམས་ཀྱི་རྒྱུན་བརྗེད་པ་མེད་པ་དང་། སེམས་ཀྱི་རྒྱུན་མ་གཡེངས་པ་དང་། ཉོན་མོངས་པ་མེད་པར་གྱུར་པའི་ཤེས་རབ་སྟེ། དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands the insight of applying oneself to the mind of awakening, gathering one’s mind, not being forgetful, being undistracted, and being without disturbing emotions.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི། དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing the faculties of the Thus-Gone One .

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands the faculties of the Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the faculties of the Thus-Gone One,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of physical actions.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་དགེ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། སྲོག་གཅོད་པ་སྤོང་བ་དང་། མ་བྱིན་པར་ལེན་པ་སྤོང་བ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་སྤོང་བ་སྟེ།
en: Householder, the Thus-Gone One correctly understands the virtuous physical actions, which are to abandon killing, to abandon taking what is not given, and to abandon desirous sexual misconduct.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་དགེ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands the virtuous physical actions.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་མི་དགེ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the unvirtuous physical actions.

source: འདི་ལ་སྲོག་གཅོད་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: He correctly understands about killing, taking what is not given, and desirous sexual misconduct.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་མི་དགེ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way Thus-Gone One correctly understands the unvirtuous physical actions.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་ལུང་དུ་མ་བསྟན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the neutral physical actions.

source: འདི་ལ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་བསམས་པ་ལས་བྱུང་བའི་རྣམ་པར་སྨིན་པ་མ་ཡིན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands the physical actions that do not ripen out of specific intentions.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་ལུས་ཀྱི་ལས་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, see, . . . and be skillful about this is called knowing the physical actions .

source: དེ་བཞིན་གཤེགས་པ་ལུས་ཀྱི་ལས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of physical actions,

source: ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་ཡང་ཇི་སྐད་བསྟན་པ་བཞིན་ནོ།། །།
en: As for the origin , cessation, and path, they are as previously taught.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of verbal actions.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་དགེ་བ་རྣམ་པ་བཞི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། བརྫུན་དུ་སྨྲ་བ་སྤངས་པ་དང་། ཕྲ་མ་སྨྲ་བ་སྤངས་པ་དང་། ངག་རྩུབ་པོ་སྨྲ་བ་སྤངས་པ་དང་། ཚིག་ཀྱལ་པ་སྤངས་པ་སྟེ།
en: Householder, the Thus-Gone One correctly understands the four virtuous verbal actions, which are to abandon lying, to abandon divisive talk, to abandon harsh words, and to abandon gossiping.

source: ངག་གི་ལས་ཀྱི་དགེ་བ་རྣམ་པ་བཞི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Thus he correctly understands the four virtuous verbal actions.

source: བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་པ་སྟེ། ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་མི་དགེ་བ་རྣམ་པ་བཞི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One also correctly understands the four unvirtuous verbal actions, which are lying, uttering divisive talk, speaking harsh words, and gossiping.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ལུང་དུ་མ་བསྟན་པ་རྣམ་པ་བཞི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the four neutral verbal actions.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་ཡོངས་སུ་སྤྱད་པ་དང་། མི་འཐུན་པར་ཡོངས་སུ་སྤྱད་པ་དང་། དུས་ཚིགས་ཀྱིས་རྣམ་པར་བསྒྱུར་བ་དང་། སྤྱོད་ལམ་ལས་བྱུང་བའི་ངག་གི་ལས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the verbal actions that engage correctly, engage incorrectly, change over time, and appear from actions.

source: དེ་ལ་ཤེས་པ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་ངག་གི་ལས་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, . . . and be skillful about this is called knowing verbal actions .

source: དེ་བཞིན་གཤེགས་པ་ངག་གི་ལས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of verbal actions,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཡིད་ཀྱི་ལས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of mental actions.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཡིད་ཀྱི་ལས་དགེ་བ་རྣམ་པ་གསུམ་རབ་ཏུ་མཁྱེན་ཏེ། བརྣབ་སེམས་མེད་པ་དང་། གནོད་སེམས་མེད་པ་དང་། ཡང་དག་པའི་ལྟ་བའོ། །
en: Householder, the Thus-Gone One correctly understands the three virtuous mental actions, which are the absence of covetousness, the absence of ill will, and the correct view.

source: ཡིད་ཀྱི་ལས་མི་དགེ་བ་རྣམ་པ་གསུམ་རབ་ཏུ་མཁྱེན་ཏེ། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བའོ། །
en: He correctly understands the three unvirtuous mental actions, which are covetousness, ill will, and wrong view.

source: ཡིད་ཀྱི་ལས་ལུང་དུ་མ་བསྟན་པ་རྣམ་པ་གསུམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ། ཡང་དག་པར་ཡོངས་སུ་སྤྱད་པ་དང་། མི་འཐུན་པར་ཡོངས་སུ་སྤྱད་པ་དང་། སྤྱོད་ལམ་ལས་བྱུང་བ་དང་། དུས་ཚིགས་ཀྱིས་རྣམ་པར་བསྒྱུར་བའོ། །
en: He correctly understands the three neutral mental actions that engage correctly, engage incorrectly, change over time, and appear from actions.

source: དེ་ལ་ཤེས་པ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་ཡིད་ཀྱི་ལས་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: To know, . . . and be skillful about this is called knowing mental actions .

source: དེ་བཞིན་གཤེགས་པ་ཡིད་ཀྱི་ལས་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of mental actions,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the preceding.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཤེས་པ་སྔོན་དུ་འགྲོ་བར་བྱས་ནས། ལུས་ཀྱི་ལས་རྩོམ་ངག་གི་ལས་རྩོམ་ཡིད་ཀྱི་ལས་རྩོམ་མོ། །
en: Householder, having first gained knowledge of the ten powers of the Thus-Gone One, he can undertake physical, verbal, and mental actions.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་གལ་ཏེ་ཟད་པ་ཤེས་པའམ། གལ་ཏེ་མི་སྐྱེ་བ་ཤེས་པའམ། གལ་ཏེ་འཁོར་བ་ཤེས་པའམ། གལ་ཏེ་མྱ་ངན་ལས་འདས་པ་ཤེས་པ་སྔོན་དུ་འགྲོ་བར་བྱས་པ་ནས་ཡིད་ཀྱི་ལས་རྩོམ་པའི་བར་དུའོ། །
en: Householder, moreover, whether he has first gained knowledge of exhaustion, no-birth, saṃsāra, or nirvāṇa, the Thus-Gone One can engage in physical, verbal, and mental actions.

source: དེ་ལ་ཤེས་པ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, . . . and be skillful about this is called knowing the preceding .

source: དེ་བཞིན་གཤེགས་པ་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the preceding,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the subsequent.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུའི་རྗེས་སུ་འཇུག་པ་ཡིན་ནོ་ཞེས་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands that all physical actions are understood through the ten powers of the Thus-Gone One.

source: ལུས་ཀྱི་ལས་གང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དག་གིས་ཡོངས་སུ་ཤེས་པ་མ་བསྐྱེད་པའམ། མི་གནས་པའམ། མི་འགག་པ་དེ་མེད་དེ།
en: There is no physical action created, abiding, or ceasing that is not known by the knowledge of the ten powers of the Thus-Gone One.

source: དེ་བཞིན་དུ་ངག་གི་ལས་དང་ཡིད་ཀྱི་ལས་ལ་ཡང་བྱའོ། །
en: The same applies to all verbal and mental actions.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་ནས་མཁས་པའི་བར་གང་ཡིན་པ་འདི་ནི་རྗེས་སུ་འཇུག་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: To know, see, . . . and be skillful about this is called knowing the subsequent .

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་གང་དམིགས་པར་མཛད་པའི་མཁྱེན་པ་དེས། རྣམ་པར་དཔྱོད་པར་མཛད་དེ།
en: Householder, moreover, the Thus-Gone One uses his knowledge of whatever he observes to discriminate.

source: བྱམས་པ་དང་ལྡན་པའི་ཐུགས་ཀྱིས་སེམས་ཅན་ལ་དམིགས་པ་གནོད་པ་མེད་པར་འཇིག་རྟེན་གནས་པ་ལ་གཟིགས་པ་ན།
en: When he gently looks at the state of the world with his loving mind and observes beings,

source: ལམ་གོལ་བར་རབ་ཏུ་ཞུགས་པ་སྲིད་པ་དང་། འགྲོ་བ་ཐམས་ཅད་གནོད་པ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་ཡོད་པ་དག་གིས་ཉེན་པར་ཐུགས་སུ་ཆུད་ནས་
en: he understands how all beings who live on errant paths and who experience misfortune, as well as old age, sickness, and death, are suffering.

source: ཐམས་ཅད་དུ་མཁྱེན་པས་དཔྱོད་པར་མཛད་པ་ནི་ཕུང་པོ་ཀུན་སྤངས་པ་མ་གཏོགས་པར་གཞན་དུ་ཅུང་ཟད་ཀྱང་གནོད་པ་མེད་པར་མ་གཟིགས་ཏེ
en: As he understands this with his omniscient mind, he realizes that there is no way to be free from such suffering in the slightest, apart from abandoning the aggregates.

source: དེའི་མཁྱེན་པ་དེས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་གོ། །
en: He is fully aware of this.

source: གནོད་པ་ཡང་གང་ཀུན་ནས་མནར་སེམས་དང་། གནོད་པ་སྤོང་བའི་ཕྱིར་གནོད་པ་མེད་པ་ཡོངས་སུ་མཁྱེན་ཏོ། །
en: It is because of wanting to end their troubles in the form of pain and distress that he understands the absence of harm.

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In this way the Thus-Gone One correctly understands the subsequent.

source: དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the subsequent,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམ་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of lack of regression.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དག་ལས་ཡོངས་སུ་མི་ཉམ་མོ། །
en: Householder, the Thus-Gone One does not regress from the eighteen unique qualities of a buddha.

source: ཁྱིམ་བདག་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ཤེས་པ་གང་ཐུགས་སུ་ཆུད་པ་དེ་ལས་ཡོངས་སུ་མི་ཉམ་སྟེ།
en: Householder, moreover, the Thus-Gone One does not regress from any knowledge that he has understood.

source: འདི་ལྟ་སྟེ། འདོད་ཆགས་སྤང་བ་ཤེས་པ་དང་། ཞེ་སྡང་སྤང་བ་ཤེས་པ་དང་། གཏི་མུག་སྤང་བ་ཤེས་པ་དེ་ལས་ཀྱང་ཡོངས་སུ་མི་ཉམ་མོ། །
en: Thus, he never regresses from knowing how to abandon desire, knowing how to abandon anger, or knowing how to abandon delusion.
